Revit 2027 API
PanelScheduleView.GetLoadClassificationId Method
 Gets the id of the associated Load Classification at the given row
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetLoadClassificationId(
	int nRow
)
Public Function GetLoadClassificationId (
	nRow As Integer
) As ElementId
public:
ElementId^ GetLoadClassificationId(
	int nRow
)
member GetLoadClassificationId :
        nRow : int -> ElementId
Parameters
nRow Int32
 Row number of Load Summary Section
Return Value
ElementId
 The element id of the Load Classification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace